library point;

final List<int> chain_bonus = [ 0,   // 1連鎖
                                8,   // 2
                               16,   // 3
                               32,   // 4
                               64,   // 5
                               96,   // 6
                               128,  // 7
                               160,  // 8
                               192,  // 9
                               224,  //10
                               256,  //11
                               288,  //12
                               320,  //13
                               352,  //14
                               384,  //15
                               416,  //16
                               448,  //17
                               480,  //18
                               512]; //19

final List<int> color_bonus = [0,   //1色
                               3,   //2
                               6,   //3
                               12,  //4
                               24]; //5

final List<int> joint_bonus = [0,   //4個
                               2,   //5
                               3,   //6
                               4,   //7
                               5,   //8
                               6,   //9
                               7,   //10
                               10]; //11個以上

const int all_clear_bonus = 2100;
